trunk/DB Tasks/Kareem-TASK/app/controllers/student_sub_courses_controller.rb

SELECT "student_sub_courses".* FROM "student_sub_courses"
---
  def index
    @student_sub_courses = StudentSubCourse.all