trunk/nokia_ruby/app/views/comments/show.json.erb

{
"content" : "<%= @comment.content %>",
"user_id" : "<%= User.find(@comment.user_id).name %>",
"id":"<%= @comment.id %>"
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]