trunk/nokia_ruby/app/views/comments/show.json.erb

{
"content" : "<%= @comment.content %>",
"user_name" : "<%= User.find(@comment.user_id).name %>",
"id":"<%= @comment.id %>",
"story_id":"<%= @comment.story_id %> ",
"ups":"<%= Upped.find_all_by_comment_id(@comment.id).length %>",
"downs":"<%= Downed.find_all_by_comment_id(@comment.id).length %>"
---
SELECT "downeds".* FROM "downeds" WHERE "downeds"."comment_id" = 8
SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."comment_id" = 8