nokia_ruby/app/controllers/friends_controller.rb

def index
    @gaheem_accounts = Friend.all
---
SELECT "friends".* FROM "friends"