nokia_ruby/app/controllers/shares_controller.rb

SELECT "shares".* FROM "shares" WHERE (created_at >= '2012-03-20 22:45:05.015175' AND created_at <= '2012-04-17 23:59:59.999999' AND story_id == 1)
---
 def index
  @shares=Share.all