nokia_ruby/app/controllers/stories_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = 1
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
   @comments = Comment.find_all_by_story_id(params[:id]) # get comments of this story
   @story = Story.find(params[:id])

SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = 8
---
    def show_comments
    @comments = Comment.find_all_by_story_id(params[:id])

SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."user_id" = 3 AND "uppeds"."comment_id" = 1 LIMIT 1
SELECT "downeds".* FROM "downeds" WHERE "downeds"."user_id" = 3 AND "downeds"."comment_id" = 1 LIMIT 1
INSERT INTO "uppeds" ("comment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["created_at", Mon, 23 Apr 2012 01:38:22 UTC +00:00], ["updated_at", Mon, 23 Apr 2012 01:38:22 UTC +00:00], ["user_id", 3]]
---
  def up_comment
    liked = Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    disliked = Downed.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    if liked.nil? && disliked.nil? then #if user never liked or disliked comment then like it
      Upped.create(:user_id=>params[:user_id],:comment_id=>params[:comment_id])

SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."user_id" = 3 AND "uppeds"."comment_id" = 1 LIMIT 1
SELECT "downeds".* FROM "downeds" WHERE "downeds"."user_id" = 3 AND "downeds"."comment_id" = 1 LIMIT 1
INSERT INTO "downeds" ("comment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["created_at", Mon, 23 Apr 2012 01:51:34 UTC +00:00], ["updated_at", Mon, 23 Apr 2012 01:51:34 UTC +00:00], ["user_id", 3]]
DELETE FROM "uppeds" WHERE "uppeds"."id" = ?  [["id", 1]]
---
  def down_comment
    liked = Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    disliked = Downed.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    if liked.nil? && disliked.nil? then #if user never liked or disliked comment then like it
      Downed.create(:user_id=>params[:user_id],:comment_id=>params[:comment_id])

# adding data to log
      commenterID = Comment.find(params[:comment_id]).user_id  # ID of the commenter
      Log.create!(loggingtype: 2,user_id_1: params[:user_id],user_id_2: commenterID,admin_id: nil,story_id: params[:id],interest_id: nil,message: User.find(params[:user_id]).name+" thumbed DOWN the comment \"" + Comment.find(params[:comment_id]).content+"\"" + " by " + User.find(commenterID).name )

    render json: "ok" and  return true
    else if !liked.nil?  then #if user liked it, now make him dislike it!
      Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id]).destroy

SELECT "stories".* FROM "stories"
---
  def index
    respond_with(@stories = Story.all) # passing a list of all stories to the view .
  end

SELECT "shares".* FROM "shares" WHERE "shares"."user_id" = 1 AND "shares"."story_id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT interest_id FROM "stories" WHERE "stories"."id" = 1 LIMIT 1
SELECT name FROM "interests" WHERE "interests"."id" IS NULL LIMIT 1
INSERT INTO "logs" ("admin_id", "created_at", "interest_id", "loggingtype", "message", "story_id", "updated_at", "user_id_1", "user_id_2") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "shares" ("created_at", "story_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 26 Apr 2012 10:18:34 UTC +00:00], ["story_id", 1], ["updated_at", Thu, 26 Apr 2012 10:18:34 UTC +00:00], ["user_id", 1]]
---
 def share_story_social_network
  @storyid=params[:sid]
  @userid=params[:uid]
  flag=User.find_by_id(@userid).share?(@storyid)

    if flag
   respond_to do |format|
      format.json{render json: "true" }
        end
    else
      respond_to do |format|
     format.json{render json:"false"}
    end
   end
@username = User.find(:first, :conditions => { :id => @userid},:select => "name")
    @storytitle = Story.find(:first, :conditions => { :id => @storyid},:select => "title")
    @interest_id = Story.find(:first, :conditions => { :id => @storyid},:select => "interest_id")
    @interesttitle = Interest.find(:first, :conditions => { :id => @interest_id},:select => "name")
  @message = "#{@username}share_story_social_network#{@storytitle}+#{@interesttitle}"

Log.create!(loggingtype: 2,user_id_1: @userid,user_id_2:nil,admin_id: nil,story_id: @storyid,interest_id: @interest_id,message: @message )

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT interest_id FROM "stories" WHERE "stories"."id" = 1 LIMIT 1
SELECT name FROM "interests" WHERE "interests"."id" IS NULL LIMIT 1
INSERT INTO "logs" ("admin_id", "created_at", "interest_id", "loggingtype", "message", "story_id", "updated_at", "user_id_1", "user_id_2") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def view_friends_like
  @storyid=params[:sid]
  @userid=params[:uid]

  @flistlike=Array.new
  @flistliked=Array.new
  @flistlike = User.find_by_id(@userid).liked()

   (0..(@flistlike.length-1)).each do |i|
    @flistliked << (@flistlike[i].email)
      end

   respond_to do |format|
     format.json{render json:@flistlike}
     end
 @username = User.find(:first, :conditions => { :id => @userid},:select => "name")
    @storytitle = Story.find(:first, :conditions => { :id => @storyid},:select => "title")
    @interest_id = Story.find(:first, :conditions => { :id => @storyid},:select => "interest_id")
    @interesttitle = Interest.find(:first, :conditions => { :id => @interest_id},:select => "name")
  @message = "#{@username}view_friends_like#{@storytitle}+#{@interesttitle}"

Log.create!(loggingtype: 2,user_id_1: @userid,user_id_2: nil,admin_id: nil,story_id: @storyid,interest_id: @interest_id,message: @message )

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT interest_id FROM "stories" WHERE "stories"."id" = 1 LIMIT 1
SELECT name FROM "interests" WHERE "interests"."id" IS NULL LIMIT 1
INSERT INTO "logs" ("admin_id", "created_at", "interest_id", "loggingtype", "message", "story_id", "updated_at", "user_id_1", "user_id_2") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
def view_friends_dislike
    @storyid=params[:sid]
    @userid=params[:uid]

  @flistdislike=Array.new
  @flistdisliked
  @flistdislike = User.find_by_id(@userid).disliked()

   (0..(@flistdislike.length-1)).each do |i|
    @flistdisliked << (@flistdislike[i].email)
      end

   respond_to do |format|
     format.json{render json:@flistdislike}
    end
@username = User.find(:first, :conditions => { :id => @userid},:select => "name")
    @storytitle = Story.find(:first, :conditions => { :id => @storyid},:select => "title")
    @interest_id = Story.find(:first, :conditions => { :id => @storyid},:select => "interest_id")
    @interesttitle = Interest.find(:first, :conditions => { :id => @interest_id},:select => "name")
  @message = "#{@username}view_friends_dislike#{@storytitle}+#{@interesttitle}"

Log.create!(loggingtype: 2,user_id_1: @userid,user_id_2: nil,admin_id: nil,story_id: @storyid,interest_id: @interest_id,message: @message )