nokia_ruby/app/controllers/user_add_interests_controller.rb

SELECT "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT 1  [["id", 1]]
SELECT interest_id FROM "user_add_interests" WHERE (user_id = '1')
---
def getinterests
@id = params[:id]
@interests =  UserAddInterest.find(:all , :conditions => ["user_id = ?" , @id ] , :select => "interest_id").map {|interest| interest.interest_id}.map {|id| Interest.find(id).name}