nokia_ruby/app/controllers/users_controller.rb

SELECT interest_id FROM "user_add_interests" WHERE (user_id = '1')
---
def feed
 @id=params[:id]
 @interests = UserAddInterest.find(:all , :conditions => ["user_id = ?" , @id ] , :select => "interest_id").map {|interest| interest.interest_id}

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Apr 2012 01:34:03 UTC +00:00], ["email", "menis@abc.com"], ["name", "menis"], ["updated_at", Fri, 20 Apr 2012 01:34:03 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    @user.haccount = Haccount.new(:email => @user.email,
                                  :password=>params[:password], :user_id => @user.id)
    @uLog = UserLogIn.create(:user_id => @user.id)

SELECT "users".* FROM "users"
---
  def index
    respond_with(@users = User.all)