DB Tasks/Shaf3y-Task/app/controllers/courses_controller.rb

def show
		@courses = Course.find(params[:id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "1"]]