DB Tasks/Shaf3y-Task/app/controllers/teachers_controller.rb

	def show
		@teachers = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "3"]]