nokia_ruby/app/views/stories/show_comments.json.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."comment_id" = 2
SELECT "downeds".* FROM "downeds" WHERE "downeds"."comment_id" = 2
---
id<%= c.id %>
name<%= if User.find(c.user_id).name.nil? then "name" else User.find(c.user_id) end%>
content<%= if c.content.nil? then "content" else c.content  end%>
up<%= Upped.find_all_by_comment_id(c.id).length %>
down<%= Downed.find_all_by_comment_id(c.id).length %>