trunk/nokia_ruby/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    respond_with(@comment = Comment.find(params[:id]))

INSERT INTO "comments" ("content", "created_at", "story_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "hahahahah"], ["created_at", Fri, 20 Apr 2012 13:41:01 UTC +00:00], ["story_id", 1], ["updated_at", Fri, 20 Apr 2012 13:41:01 UTC +00:00], ["user_id", 4]]
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments"
---
  def index
    respond_with(@comments = Comment.all)