trunk/nokia_ruby/app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends"
---
def index
    @gaheem_accounts = Friend.all