trunk/nokia_ruby/app/controllers/interests_controller.rb

  def index
    @interests = Interest.all #passing a list of all interests to show them all in the view
---
SELECT "interests".* FROM "interests"

  def show

    @interests = Interest.all
    @interest = Interest.find(params[:id])#retrieving the interest from the database using the id
---
SELECT "interests".* FROM "interests" WHERE "interests"."id" = ? LIMIT 1  [["id", "1"]]