trunk/nokia_ruby/app/controllers/logs_controller.rb

  def index
        $datefilter = false
        if @emptydate!=true
         $admins = "true"
          $users = "true"
          $stories = "true"
          $interests = "true"
          @emptydate = false
        end
        $logs = Log.order("created_at DESC")
---
SELECT "logs".* FROM "logs" ORDER BY created_at DESC