trunk/nokia_ruby/app/controllers/statistics_controller.rb

SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT created_at, count(story_id) as noOfSharesPerDay FROM "shares" WHERE "shares"."story_id" = 1 AND ("shares"."created_at" BETWEEN '2012-04-17 00:00:00.000000' AND '2012-04-20 23:59:59.999999') GROUP BY date(created_at)
SELECT created_at, count(story_id) as noOfDislikesPerDay FROM "likedislikes" WHERE "likedislikes"."story_id" = 1 AND "likedislikes"."action" = -1 AND ("likedislikes"."created_at" BETWEEN '2012-04-17 00:00:00.000000' AND '2012-04-20 23:59:59.999999') GROUP BY date(created_at)
SELECT created_at, count(story_id) as noOfSpamsPerDay FROM "flags" WHERE "flags"."story_id" = 7 AND ("flags"."created_at" BETWEEN '2012-04-20 00:00:00.000000' AND '2012-04-23 23:59:59.999999') GROUP BY date(created_at)
SELECT COUNT(*) FROM "shares" WHERE "shares"."story_id" = 7
SELECT COUNT(*) FROM "likedislikes" WHERE "likedislikes"."story_id" = 7 AND "likedislikes"."action" = -1
SELECT COUNT(*) FROM "flags" WHERE "flags"."story_id" = 7
---
 def stories
   @id=params[:id]
   @story= Story.find(@id)
   #The following query is done because the associations between the tables
   #are missing right now
   @interest_id= @story.interest_id
   @interest = Interest.find(@interest_id)
   @interest_name = @interest.name
   @shares = Share.where(:story_id => @id)
   @likes = Likedislike.where(:story_id => @id, :action => 1)
   @dislikes = Likedislike.where(:story_id => @id, :action => -1)
   @flags = Flag.where(:story_id => @id)
   @creation_date = @story.created_at.beginning_of_day
   @last_update = @story.updated_at.end_of_day
   @hidden = @story.hidden_before_type_cast
   @total_shares = @shares.count
   @total_likes = @likes.count
   @total_dislikes = @dislikes.count
   @total_flags = @flags.count