trunk/nokia_ruby/app/controllers/stories_controller.rb

  def show
   @comments = Comment.find_all_by_story_id(params[:id]) # get comments of this story
   @story = Story.find(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = 1
SELECT "stories".* FROM "stories" WHERE "stories"."id" = ? LIMIT 1  [["id", "1"]]

    def show_comments
    @comments = Comment.find_all_by_story_id(params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = 8

  def up_comment
    liked = Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    disliked = Downed.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    if liked.nil? && disliked.nil? then #if user never liked or disliked comment then like it
      Upped.create(:user_id=>params[:user_id],:comment_id=>params[:comment_id])
---
SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."user_id" = 3 AND "uppeds"."comment_id" = 1 LIMIT 1
SELECT "downeds".* FROM "downeds" WHERE "downeds"."user_id" = 3 AND "downeds"."comment_id" = 1 LIMIT 1
INSERT INTO "uppeds" ("comment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["created_at", Mon, 23 Apr 2012 01:38:22 UTC +00:00], ["updated_at", Mon, 23 Apr 2012 01:38:22 UTC +00:00], ["user_id", 3]]

  def down_comment
    liked = Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    disliked = Downed.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id])
    if liked.nil? && disliked.nil? then #if user never liked or disliked comment then like it
      Downed.create(:user_id=>params[:user_id],:comment_id=>params[:comment_id])

# adding data to log
      commenterID = Comment.find(params[:comment_id]).user_id  # ID of the commenter
      Log.create!(loggingtype: 2,user_id_1: params[:user_id],user_id_2: commenterID,admin_id: nil,story_id: params[:id],interest_id: 0,message: User.find(params[:user_id]).name+" thumbed DOWN the comment " + Comment.find(params[:comment_id]).content + " by " + User.find(commenterID).name )

    render json: "ok" and  return true
    else if !liked.nil?  then #if user liked it, now make him dislike it!
      Upped.find_by_user_id_and_comment_id(params[:user_id],params[:comment_id]).destroy
---
SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."user_id" = 3 AND "uppeds"."comment_id" = 1 LIMIT 1
SELECT "downeds".* FROM "downeds" WHERE "downeds"."user_id" = 3 AND "downeds"."comment_id" = 1 LIMIT 1
INSERT INTO "downeds" ("comment_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["created_at", Mon, 23 Apr 2012 01:51:34 UTC +00:00], ["updated_at", Mon, 23 Apr 2012 01:51:34 UTC +00:00], ["user_id", 3]]
DELETE FROM "uppeds" WHERE "uppeds"."id" = ?  [["id", 1]]

  def index
    respond_with(@stories = Story.all) # passing a list of all stories to the view .
  end
---
SELECT "stories".* FROM "stories"