trunk/nokia_ruby/app/controllers/users_controller.rb

 def show
    respond_with(@user = User.find(params[:id]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "3"]]

def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 20 Apr 2012 01:34:03 UTC +00:00], ["email", "menis@abc.com"], ["name", "menis"], ["updated_at", Fri, 20 Apr 2012 01:34:03 UTC +00:00]]

  def index
    respond_with(@users = User.all)
---
SELECT "users".* FROM "users"

def feed
 @id=params[:id]
 @interests = User.find(:first,:conditions => ["id = ?",@id],:select => "interests")
---
SELECT interests FROM "users" WHERE (id = 'search') LIMIT 1