trunk/nokia_ruby/app/controllers/users_controller.rb

SELECT interest_id FROM "user_add_interests" WHERE (user_id = '1')
---
def feed
 @id=params[:id]
 @interests = UserAddInterest.find(:all , :conditions => ["user_id = ?" , @id ] , :select => "interest_id").map {|interest| interest.interest_id}