trunk/nokia_ruby/app/views/statistics/all_users.html.erb

<script type="text/javascript" charset="utf-8">
$(document).ready(function() {
      //get The users' array of arrays of data
      data= <%= get_all_users_stat %>
      if (data.length != 0) {
      //the graphs that we want to show
      names=["Registered Users","Logged in"];
      //the time interval between one point and another in the graph.
      pointInterval= <%= 1.day * 1000 %>
      // Start point of the graph.
      x= <%= get_all_users_start_date %>
      if(x != -1) {
      pointStart= <%= get_all_users_start_date.days.ago.to_i * 1000 %>
      //Label for x-axis
      xl="Day";
      yl="Number";
      titleOfGraph="All Users Stat.";
      //call the method that renders the graph with the calculated parameters.
     document.getElementById("noUser").style.display= "none";
      Graph(data,names,pointInterval,pointStart,xl,yl,titleOfGraph);
      } else {
       document.getElementById("noUser").style.display= "block";
---
SELECT created_at , count(id) as regs_day FROM "users" WHERE ("users"."created_at" BETWEEN '2012-04-25 00:00:00.000000' AND '2012-04-26 23:59:59.999999') GROUP BY date(created_at)