nokia_ruby/app/views/statistics/stories.html.erb

            <!--Here we'll get the users who shared the given story with a link to the profile page of each user:-->
            <% Share.where(:story_id => @id).find_each do |share| %>
---
SELECT created_at, count(story_id) as noOfSharesPerDay FROM "shares" WHERE "shares"."story_id" = 1 AND ("shares"."created_at" BETWEEN '2012-04-17 00:00:00.000000' AND '2012-04-20 23:59:59.999999') GROUP BY date(created_at)