trunk/nokia_ruby/app/views/stories/show_comments.json.erb

{"Comments":[<% @n = @comments.length %><% @comments.each do |c| %><% @n-=1 %>{"id":"<%= c.id %>","user_name":"<%= if User.find(c.user_id).name.nil? then "name" else User.find(c.user_id) end%>","content":"<%= if c.content.nil? then "content" else c.content  end%>","story_id":"<%= c.story_id %>",
"ups":"<%= Upped.find_all_by_comment_id(c.id).length %>","downs":"<%= Downed.find_all_by_comment_id(c.id).length %>"}<%= "," if(@n>0)%><% end %>]}
---
SELECT "comments".* FROM "comments" WHERE "comments"."story_id" = 8
SELECT "downeds".* FROM "downeds" WHERE "downeds"."comment_id" = 2
SELECT "uppeds".* FROM "uppeds" WHERE "uppeds"."comment_id" = 2
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]